#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_iam_role.carguero-technical-challenge-node-role: Refreshing state... [id=carguero-technical-challenge-node-role]
aws_vpc.carguero-technical-challenger-vpc: Refreshing state... [id=vpc-077e0f34f3d482df7]
data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
aws_iam_role.carguero-technical-challenge-iam-role: Refreshing state... [id=carguero-technical-challenge-role]
aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy: Refreshing state... [id=carguero-technical-challenge-role-20230615022416455200000001]
aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy: Refreshing state... [id=carguero-technical-challenge-role-20230615022416489900000002]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615022416600800000003]
aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615022416634000000004]
aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615022416658300000005]
aws_internet_gateway.carguero-technical-challenger-ig: Refreshing state... [id=igw-041fd372e1c5a7c4b]
aws_subnet.carguero-technical-challenger-subnet[0]: Refreshing state... [id=subnet-0f4c727850e3cb98d]
aws_subnet.carguero-technical-challenger-subnet[1]: Refreshing state... [id=subnet-09ebc958fb997b2f3]
aws_route_table.carguero-technical-challenger-rt: Refreshing state... [id=rtb-05f9f3163556a957a]
aws_eks_cluster.carguero-technical-challenge: Refreshing state... [id=carguero-technical-challenge-cluster]
aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-068404869aebf576e]
aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-02f7aaed2b18c14f3]
aws_eks_node_group.carguero-technical-challenge-node-group[0]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.carguero-technical-challenge-node-group[0] is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:140280519783:nodegroup/carguero-technical-challenge-cluster/carguero-technical-challenge-node-1/48c45e74-4304-84c8-bac5-3c26ac3d133f" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "carguero-technical-challenge-cluster:carguero-technical-challenge-node-1" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.27.1-20230607" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "carguero-technical-challenge-node-1"
        }
      ~ version                = "1.27" -> (known after apply)
        # (6 unchanged attributes hidden)

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_subnet.carguero-technical-challenger-subnet[0] will be updated in-place
  ~ resource "aws_subnet" "carguero-technical-challenger-subnet" {
        id                                             = "subnet-0f4c727850e3cb98d"
      ~ map_public_ip_on_launch                        = false -> true
        tags                                           = {
            "Name" = "carguero-technical-challenge-subnet-1"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.carguero-technical-challenger-subnet[1] will be updated in-place
  ~ resource "aws_subnet" "carguero-technical-challenger-subnet" {
        id                                             = "subnet-09ebc958fb997b2f3"
      ~ map_public_ip_on_launch                        = false -> true
        tags                                           = {
            "Name" = "carguero-technical-challenge-subnet-2"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*